Tekla Open API Reference for Tekla Structures 2025
Part.PartAttributes.CenterLine Property
 The line type of the center line.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineTypeAttributes CenterLine { get; set; }
Public Property CenterLine As LineTypeAttributes
	Get
	Set
Property Value
Type: LineTypeAttributes
See Also
Reference
Part.PartAttributes Class
Tekla.Structures.Drawing Namespace